/********************************** (C) COPYRIGHT ******************************
* File Name		: Freqsys
* Author		: Antecer
* Version		: V1.0
* Date			: 2020年10月09日
* Description	: 单片机频率系统定义
*******************************************************************************/
#include "CH552.h"
#include "Freqsys.h"

/*******************************************************************************
* Function Name	: SetFsys
* Description	: 设置系统时钟频率
* Info			: 内核时钟12MHz
				: PLL倍频=96MHz
				: USB时钟分频器=48MHz	(USB模块FullSpeed模式需要48MHz频率)
				: 系统时钟分频器=24MHz
*******************************************************************************/
void setFsys(void)
{
	SAFE_MOD = 0x55;		//解锁安全模式
	SAFE_MOD = 0xAA;
	CLOCK_CFG = 0x86;		//系统时钟分频器4分频=24MHz
}
/*******************************************************************************
* Function Name  : mDelayus(UNIT16 n)
* Description    : us延时函数
* Input          : UNIT16 n
*******************************************************************************/
void mDelayuS(UINT16 n)
{
	while (n)
	{
		++SAFE_MOD;
		--n;
	}
}
/*******************************************************************************
* Function Name  : mDelayms(UNIT16 n)
* Description    : ms延时函数
* Input          : UNIT16 n
*******************************************************************************/
void mDelaymS(UINT16 n)
{
	while (n)
	{
		mDelayuS(1000);
		--n;
	}
}